paw_pals_backend/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        cats = Cat.all

INSERT INTO "cats" ("name", "age", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Jeremiah"], ["age", 15], ["bio", "cat nip, taking naps, hunting bugs"], ["created_at", "2019-06-06 21:23:37.353759"], ["updated_at", "2019-06-06 21:23:37.353759"]]
---
    def create
        cat = Cat.create(cat_params)